==================
Simple property
==================

User {UserId} logged in

---

(template
  (literal_text)
  (property
    (open_brace)
    name: (identifier)
    (close_brace))
  (literal_text))

==================
Multiple properties
==================

User {UserId} performed {Action} at {Timestamp}

---

(template
  (literal_text)
  (property
    (open_brace)
    name: (identifier)
    (close_brace))
  (literal_text)
  (property
    (open_brace)
    name: (identifier)
    (close_brace))
  (literal_text)
  (property
    (open_brace)
    name: (identifier)
    (close_brace)))

==================
Property with format
==================

Price: {Amount:F2} USD

---

(template
  (literal_text)
  (property
    (open_brace)
    name: (identifier)
    format: (format_spec
      format_string: (identifier))
    (close_brace))
  (literal_text))

==================
Property with capture hint @
==================

Order {@Order} created

---

(template
  (literal_text)
  (property
    (open_brace)
    hint: (hint_symbol)
    name: (identifier)
    (close_brace))
  (literal_text))

==================
Property with scalar hint $
==================

Error: {$Error}

---

(template
  (literal_text)
  (property
    (open_brace)
    hint: (hint_symbol)
    name: (identifier)
    (close_brace)))

==================
Numeric indexed properties
==================

Processing {0} of {1} items

---

(template
  (literal_text)
  (property
    (open_brace)
    name: (numeric_index)
    (close_brace))
  (literal_text)
  (property
    (open_brace)
    name: (numeric_index)
    (close_brace))
  (literal_text))

==================
Dotted OTEL property
==================

HTTP {http.method} to {http.url} returned {http.status_code}

---

(template
  (literal_text)
  (property
    (open_brace)
    name: (dotted_name
      (identifier)
      (identifier))
    (close_brace))
  (literal_text)
  (property
    (open_brace)
    name: (dotted_name
      (identifier)
      (identifier))
    (close_brace))
  (literal_text)
  (property
    (open_brace)
    name: (dotted_name
      (identifier)
      (identifier))
    (close_brace)))

==================
Complex format specifier
==================

Timestamp: {Time:yyyy-MM-dd HH:mm:ss}

---

(template
  (literal_text)
  (property
    (open_brace)
    name: (identifier)
    format: (format_spec
      format_string: (identifier))
    (close_brace)))
